test-results/Prod/Kraken_infiniband/fio
./fio examples/rbd.fio
rbd_iodepth32: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rbd, iodepth=32
fio-2.20-32-g9af5a
Starting 1 process
Jobs: 1 (f=1): [w(1)][100.0%][r=0KiB/s,w=15.5MiB/s][r=0,w=3964 IOPS][eta 00m:00s]
rbd_iodepth32: (groupid=0, jobs=1): err= 0: pid=2438214: Mon Jun  5 13:51:18 2017
  write: IOPS=4174, BW=16.3MiB/s (17.1MB/s)(2048MiB/125578msec)
    slat (usec): min=2, max=1087, avg= 6.53, stdev= 5.09
    clat (msec): min=1, max=135, avg= 7.66, stdev= 5.47
     lat (msec): min=1, max=135, avg= 7.66, stdev= 5.47
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    7], 60.00th=[    7],
     | 70.00th=[    8], 80.00th=[   10], 90.00th=[   13], 95.00th=[   16],
     | 99.00th=[   27], 99.50th=[   36], 99.90th=[   69], 99.95th=[   95],
     | 99.99th=[  113]
   bw (  KiB/s): min= 2488, max=21704, per=0.10%, avg=16707.98, stdev=2294.62
    lat (msec) : 2=0.01%, 4=4.73%, 10=78.37%, 20=14.19%, 50=2.47%
    lat (msec) : 100=0.19%, 250=0.04%
  cpu          : usr=27.89%, sys=71.20%, ctx=347722, majf=0, minf=250665
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,524288,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=16.3MiB/s (17.1MB/s), 16.3MiB/s-16.3MiB/s (17.1MB/s-17.1MB/s), io=2048MiB (2147MB), run=125578-125578msec

Disk stats (read/write):
    dm-1: ios=0/495, merge=0/0, ticks=0/2316, in_queue=2316, util=0.20%, aggrios=0/232, aggrmerge=0/288, aggrticks=0/820, aggrin_queue=820, aggrutil=0.21%
  sda: ios=0/232, merge=0/288, ticks=0/820, in_queue=820, util=0.21%